Rokasbarasa1/STM32-Quadcopter/src/main.c
uint32_t interrupt = 0;
uint32_t interrupt_end = 0;

// ------------------------------------------------------------------------------------------------------ Refresh rate
// Nyquist: sampling frequency must be at least double that of the highest frequency of interest
// The MPU6050 has a lowpass set to 260Hz we need to be able to manipulate all the frequencies until that. So 260 * 2 = 520
#define REFRESH_RATE_HZ 520

const uint16_t precalculated_timing_miliseconds = (1000000 / REFRESH_RATE_HZ);
// ------------------------------------------------------------------------------------------------------ handling loop timing
// Timing
// TODO: Change this variable to uint64 later
uint64_t absolute_microseconds_since_start = 0;
uint64_t loop_start_timestamp_microseconds = 0;
uint64_t delta_time_without_waiting_from_previous_loop_microseconds = 0;
uint64_t delta_time_total_loop_time_previous_loop_microseconds = 0;


uint16_t loop_start_microseconds = 0; // The timer is only 16 bits
uint16_t loop_start_miliseconds = 0; // Fallback if the microseconds overflew

// Keep track of time in each loop. Since loop start
uint32_t startup_time_microseconds = 0;
uint32_t delta_time = 0;
uint8_t time_since_startup_hours = 0;
uint8_t time_since_startup_minutes = 0;
uint8_t time_since_startup_seconds = 0;
uint16_t time_since_startup_ms = 0;
uint16_t time_since_startup_microseconds;

uint8_t entered_loop = 0;

// ------------------------------------------------------------------------------------------------------ Motor settings
const uint32_t dshot_refresh_rate = 500; // Hz

#define max_dshot600_throttle_value 2047
#define min_dshot600_throttle_value 48

#define max_dshot600_command_value 47
#define min_dshot600_command_value 1

#define dshot600_neutral_value 0
#define actual_min_dshot600_throttle_value 91 // Lowest value that lets the motors spin freely and at low rpm

// Take 75 percent of max because my battery can't handle all that current.
const uint16_t actual_max_dshot600_throttle_value = min_dshot600_throttle_value + ((max_dshot600_throttle_value - min_dshot600_throttle_value) * 50) / 100; // (max lipo amp rating / max draw of a bldc motor being used x 4) 0.917 * (max_pwm - min_pwm) + min_pwm = 371.4

// Motor 0 - BL, 1 - BR, 2 - FR, 3 - FL
float motor_power[] = {0.0, 0.0, 0.0, 0.0}; // Percent
float motor_frequency[] = {0.0, 0.0, 0.0, 0.0};
float motor_rpm[] = {0.0, 0.0, 0.0, 0.0};

float throttle_value = 0.0; 
uint8_t motor_rotor_poles = 14; // it is the 14 value from 12N14P of ECO II 2807

// Motor handles
uint8_t motor_BL;
uint8_t motor_BR;
uint8_t motor_FR;
uint8_t motor_FL;

// For calculations
uint16_t throttle_value_FR;
uint16_t throttle_value_FL;
uint16_t throttle_value_BL;
uint16_t throttle_value_BR;

// If REFRESH_RATE_HZ >= 500 HZ then the control loop will handle the bdshot600 sending
// else the interrupt on timer 3 will handle it
uint8_t manual_bdshot = 0;

// Used by the bdshot600 protocol for all the motors
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef* htim){
    if(htim->Instance == TIM3){
        interrupt = DWT->CYCCNT;
        bdshot600_dma_send_all_motor_data();
        interrupt_end = DWT->CYCCNT;
    }
}

// Handlers for dma bdshot600 pins
// Without the handlers the DMA will crash the system
void DMA2_Stream1_IRQHandler(void){
    HAL_DMA_IRQHandler(bdshot600_dma_get_dma_handle(motor_BL));
}

void DMA2_Stream4_IRQHandler(void){
    HAL_DMA_IRQHandler(bdshot600_dma_get_dma_handle(motor_BR));
}

void DMA1_Stream6_IRQHandler(void){
    HAL_DMA_IRQHandler(bdshot600_dma_get_dma_handle(motor_FL));
}

void DMA1_Stream1_IRQHandler(void){
    HAL_DMA_IRQHandler(bdshot600_dma_get_dma_handle(motor_FR));
}

// ------------------------------------------------------------------------------------------------------ Sensor calibrations


// Find soft and hard iron in the field
// Do the lazy suzan spin to find non linearity errors
// Do backwards motors spin


// Convert readings from this site to same units nanoTeslas to microteslas
// https://www.ngdc.noaa.gov/geomag/calculators/magcalc.shtml#igrfwmm
// When calculating this remember that these values are already
// correcting and that the axis of the magnetometer are switched.

// For calibrating the magnetometer I
// used a method found in MicWro Engr Video:
// https://www.youtube.com/watch?v=MinV5V1ioWg
// Mag field norm at my location is 50.503
// use software called Magneto 1.2

// motor 2807

// Magnetometer MMC5603 field
float magnetometer_mmc5603_hard_iron_correction[3] = {
    3278.120072, 3274.994569, 3270.926288
};

float magnetometer_mmc5603_soft_iron_correction[3][3] = {
    {1.001581, -0.002604, -0.008801},
    {-0.002604, 0.980725, 0.063952},
    {-0.008801, 0.063952, 1.046160}
};



// Magnetometer BMM350 at field far old
float magnetometer_hard_iron_correction[3] = {
    -11.106392, 2.754993, -2.908094
};

float magnetometer_soft_iron_correction[3][3] = {
    {0.987158, -0.007043, -0.007839},
    {-0.007043, 0.997832, -0.006877},
    {-0.007839, -0.006877, 1.063742}
};



// ist8310 at field
float magnetometer_ist8310_hard_iron_correction[3] = {
    -5.731186, -16.150355, 3.217410
};

float magnetometer_ist8310_soft_iron_correction[3][3] = {
    {1.064339, -0.001697, 0.019543},
    {-0.001697, 1.036534, 0.016589},
    {0.019543, 0.016589, 0.969919}
};





float accelerometer_correction[3] = {
    0.057752, -0.016512, 0.980417
};

float accelerometer_scale_factor_correction[3][3] = {
    {1.0, 0.0, 0.0},
    {0.0, 1.0, 0.0},
    {0.0, 0.0, 1.0}
};

// Gyro
float gyro_correction[3] = {
    -2.532809, 2.282250, 0.640916
};

float base_accelerometer_roll_offset = -1.2 - -0.9825;
float base_accelerometer_pitch_offset = -0.76 - -0.8275;

float accelerometer_roll_offset = 0;
float accelerometer_pitch_offset = 0;

float yaw_offset = -180.0;
float magnetometer_roll_offset = 0.0f;
float magnetometer_pitch_offset = 2.0f;

// ------------------------------------------------------------------------------------------------------ Accelerometer values to degrees conversion
float accelerometer_roll = 0;
float accelerometer_pitch = 0;

float gyro_yaw = 0;
float magnetometer_yaw_unrotated_no_tilt = 0;
float magnetometer_yaw_unrotated_tilt = 0;
float magnetometer_yaw_no_tilt = 0;
float magnetometer_yaw = 0;
float magnetometer_yaw_secondary = 0;


float magnetometer_yaw_90 = 0;
float magnetometer_yaw_180 = 0;
float magnetometer_yaw_270 = 0;


