Rokasbarasa1/STM32-Quadcopter/src/main.c
float magnetometer_yaw_unfiltered_no_tilt = 0;

float magnetometer_ist8310_yaw_unrotated_no_tilt = 0;
float magnetometer_ist8310_yaw_unrotated_tilt = 0;
float magnetometer_ist8310_yaw_no_tilt = 0;
float magnetometer_ist8310_yaw = 0;
float magnetometer_ist8310_yaw_unfiltered_no_tilt = 0;

float magnetometer_data_unfiltered[3] = {0,0,0};
float magnetometer_data_ist8310_unfiltered[3] = {0,0,0};


// ------------------------------------------------------------------------------------------------------ Radio config
uint8_t tx_address[5] = {0xEE, 0xDD, 0xCC, 0xBB, 0xAA};
char rx_data[32];
char rx_type[32];

// ------------------------------------------------------------------------------------------------------ PID stuff
struct pid acro_roll_pid;
struct pid acro_pitch_pid;
struct pid acro_yaw_pid;

struct pid angle_pitch_pid;
struct pid angle_roll_pid;

struct pid altitude_hold_pid;

struct pid gps_longitude_pid;
struct pid gps_latitude_pid;

float error_acro_roll = 0;
float error_acro_pitch = 0;
float error_acro_yaw = 0;

float error_angle_pitch = 0;
float error_angle_roll = 0;

float error_throttle = 0;
float error_vertical_velocity = 0;
float error_altitude_barometer = 0;

float error_latitude = 0;
float error_longitude = 0;
float last_error_roll = 0;
float last_error_pitch = 0;


// Notes for PID
// 1) It is important that the natural state without power of the drone is not stable, otherwise 
// some offset of center off mass or pid desired point needs to introduced
// 2) Remember that the drone when in the air has motors spinning at idle power, just enough 
// to float in the air. If you are testing with drone constrained add a base motor speed to account for this.


// Actual PID adjustment for pitch
#define BASE_ANGLE_roll_pitch_MASTER_GAIN 0.70
#define BASE_ANGLE_roll_pitch_GAIN_P 14.0
#define BASE_ANGLE_roll_pitch_GAIN_I 150.0
#define BASE_ANGLE_roll_pitch_GAIN_D 0.0 // Very bad results when used

#define BASE_ACRO_roll_pitch_MASTER_GAIN 0.65
#define BASE_ACRO_roll_pitch_GAIN_P 0.58
#define BASE_ACRO_roll_pitch_GAIN_I 0.0
#define BASE_ACRO_roll_pitch_GAIN_D 0.01

#define BASE_ALTITUDE_HOLD_MASTER_GAIN 1.0
#define BASE_ALTITUDE_HOLD_GAIN_P 0.1 // 1.15
#define BASE_ALTITUDE_HOLD_GAIN_I 0.0 // 0.0010
#define BASE_ALTITUDE_HOLD_GAIN_D 0.0

#define BASE_GPS_HOLD_MASTER_GAIN 1.0
#define BASE_GPS_HOLD_GAIN_P 0.3
#define BASE_GPS_HOLD_GAIN_I 0.0
#define BASE_GPS_HOLD_GAIN_D 0.0

// Used for smooth changes to PID while using remote control. Do not touch this
float angle_roll_pitch_master_gain = BASE_ANGLE_roll_pitch_MASTER_GAIN;
float angle_roll_pitch_gain_p = BASE_ANGLE_roll_pitch_GAIN_P;
float angle_roll_pitch_gain_i = BASE_ANGLE_roll_pitch_GAIN_I;
float angle_roll_pitch_gain_d = BASE_ANGLE_roll_pitch_GAIN_D;

float added_angle_roll_pitch_master_gain = 0.0f;
float added_angle_roll_pitch_gain_p = 0.0f;
float added_angle_roll_pitch_gain_i = 0.0f;
float added_angle_roll_pitch_gain_d = 0.0f;

float acro_roll_pitch_master_gain = BASE_ACRO_roll_pitch_MASTER_GAIN;
float acro_roll_pitch_gain_p = BASE_ACRO_roll_pitch_GAIN_P;
float acro_roll_pitch_gain_i = BASE_ACRO_roll_pitch_GAIN_I;
float acro_roll_pitch_gain_d = BASE_ACRO_roll_pitch_GAIN_D;

float added_acro_roll_pitch_master_gain = 0.0f;
float added_acro_roll_pitch_gain_p = 0.0f;
float added_acro_roll_pitch_gain_i = 0.0f;
float added_acro_roll_pitch_gain_d = 0.0f;

// PID for acro yaw
const float acro_yaw_gain_master = 4.0;
const float acro_yaw_gain_p = 0.45;
const float acro_yaw_gain_i = 0.3;

// PID for altitude control
float altitude_hold_master_gain = BASE_ALTITUDE_HOLD_MASTER_GAIN;
float altitude_hold_gain_p = BASE_ALTITUDE_HOLD_GAIN_P;
float altitude_hold_gain_i = BASE_ALTITUDE_HOLD_GAIN_I;
float altitude_hold_gain_d = BASE_ALTITUDE_HOLD_GAIN_D;

float added_altitude_hold_master_gain = 0.0f;
float added_altitude_hold_gain_p = 0.0f;
float added_altitude_hold_gain_i = 0.0f;
float added_altitude_hold_gain_d = 0.0f;

// PID for gps hold
float gps_hold_master_gain = BASE_GPS_HOLD_MASTER_GAIN;
float gps_hold_gain_p = BASE_GPS_HOLD_GAIN_P;
float gps_hold_gain_i = BASE_GPS_HOLD_GAIN_I;
float gps_hold_gain_d = BASE_GPS_HOLD_GAIN_D;

float added_gps_hold_master_gain = 0.0f;
float added_gps_hold_gain_p = 0.0f;
float added_gps_hold_gain_i = 0.0f;
float added_gps_hold_gain_d = 0.0f;

float acro_target_roll = 0.0;
float acro_target_pitch = 0.0;
float acro_target_yaw = 0.0;

float angle_target_pitch = 0.0;
float angle_target_roll = 0.0;

float target_altitude_barometer = 0.0;
uint8_t target_altitude_barometer_set = 0;
float last_throttle_deadzone = 0.0;

float altitude_barometer_rate_of_change_max_cm_s = 30.0f;
float target_longitude = 0.0;
float target_latitude = 0.0;

uint8_t target_lon_lat_set = 0;

// ------------------------------------------------------------------------------------------------------ Some configurations relating to PID
const float gps_pid_angle_of_attack_max = 7.5f;

float acro_mode_rate_degrees_per_second = 100;
float angle_mode_rate_degrees_per_second_max_integral_derivative = 3; // At max the integral can accumulate 3 degrees per second of rotation. This is to prevent overshooting

// ------------------------------------------------------------------------------------------------------ Sensor other data

// Raw versions of data
float gyro_angular_raw[] = {0,0,0};
float acceleration_data_raw[] = {0,0,0};
float magnetometer_data_raw[] = {0,0,0};
float magnetometer_data_secondary_raw[] = {0,0,0};
float magnetometer_data_ist8310_raw[] = {0,0,0};

float altitude_barometer_raw = 0.0f;
float acceleration_data_previous[] = {0,0,0};
float magnetometer_data_ist8310[] = {0,0,0};

float magnetometer_data_90[] = {0,0,0};
float magnetometer_data_180[] = {0,0,0};
float magnetometer_data_270[] = {0,0,0};
 
// In use versions of data
float acceleration_data[] = {0,0,0};
float gyro_angular[] = {0,0,0};
float imu_orientation[] = {0,0,0};
float old_imu_orientation[] = {0,0,0};
float magnetometer_data[] = {0,0,0};
float magnetometer_data_secondary[] = {0,0,0};

float gyro_yaw_old = 0.0f; // For testing yaw

float magnetometer_data_current_unfiltered[] = {0,0,0}; // For testing yaw
float magnetometer_low_pass[] = {0,0,0}; // For testing yaw

float gps_yaw = 0;
uint8_t gps_fix_type = 0;
uint8_t gps_satellites_count = 0;
uint8_t got_gps = 0;

uint8_t gps_can_be_used = 0;
float gps_latitude = 0.0;
float gps_longitude = 0.0;

float lat_distance_to_target_meters = 0.0;
float lon_distance_to_target_meters = 0.0;



uint8_t got_ist8310_reading = 0;
uint32_t magnetometer_reading_timestamp_time_microseconds = 5000;
uint32_t last_magnetometer_reading_timestamp_microseconds = 0;



