Rokasbarasa1/STM32-Quadcopter/src/main.c
// mag2 x -10 168.085000
// mag2 y -12 166.575000
// mag2 z -12 166.575000


const uint8_t compass_frequency_values_amount = 100;

const float compass_frequency_frequency_samples[] = {
     0.000000,
    1.682576,
    3.365152,
    5.047727,
    6.730303,
    8.412879,
    10.095455,
    11.778030,
    13.460606,
    15.143182,
    16.825758,
    18.508333,
    20.190909,
    21.873485,
    23.556061,
    25.238636,
    26.921212,
    28.603788,
    30.286364,
    31.968939,
    33.651515,
    35.334091,
    37.016667,
    38.699242,
    40.381818,
    42.064394,
    43.746970,
    45.429545,
    47.112121,
    48.794697,
    50.477273,
    52.159848,
    53.842424,
    55.525000,
    57.207576,
    58.890152,
    60.572727,
    62.255303,
    63.937879,
    65.620455,
    67.303030,
    68.985606,
    70.668182,
    72.350758,
    74.033333,
    75.715909,
    77.398485,
    79.081061,
    80.763636,
    82.446212,
    84.128788,
    85.811364,
    87.493939,
    89.176515,
    90.859091,
    92.541667,
    94.224242,
    95.906818,
    97.589394,
    99.271970,
    100.954545,
    102.637121,
    104.319697,
    106.002273,
    107.684848,
    109.367424,
    111.050000,
    112.732576,
    114.415152,
    116.097727,
    117.780303,
    119.462879,
    121.145455,
    122.828030,
    124.510606,
    126.193182,
    127.875758,
    129.558333,
    131.240909,
    132.923485,
    134.606061,
    136.288636,
    137.971212,
    139.653788,
    141.336364,
    143.018939,
    144.701515,
    146.384091,
    148.066667,
    149.749242,
    151.431818,
    153.114394,
    154.796970,
    156.479545,
    158.162121,
    159.844697,
    161.527273,
    163.209848,
    164.892424,
    166.575000
};

const float compass_frequency_mag1_x_offsets[] ={
    0.000000,
    0.000000,
    0.217936,
    0.252581,
    0.297227,
    0.283227,
    0.347227,
    0.421227,
    0.491227,
    0.517227,
    0.463227,
    0.401227,
    0.395227,
    0.407227,
    0.445227,
    0.509227,
    0.557227,
    0.579227,
    0.577227,
    0.577227,
    0.571227,
    0.571227,
    0.569227,
    0.569227,
    0.561227,
    0.599227,
    0.575227,
    0.559227,
    0.611227,
    0.659227,
    0.631227,
    0.671227,
    0.693227,
    0.661227,
    0.655227,
    0.667227,
    0.675227,
    0.683227,
    0.719227,
    0.739227,
    0.779227,
    0.777227,
    0.791227,
    0.785227,
    0.781227,
    0.805227,
    0.833227,
    0.847227,
    0.841227,
    0.863227,
    0.871227,
    0.897227,
    0.899227,
    0.907227,
    0.901227,
    0.911227,
    0.931227,
    0.973227,
    1.063227,
    1.119227,
    1.139227,
    1.187227,
    1.213227,
    1.199227,
    1.207227,
    1.191227,
    1.243227,
    1.305227,
    1.295227,
    1.329227,
    1.363227,
    1.295227,
    1.269227,
    1.329227,
    1.341227,
    1.381227,
    1.425227,
    1.451227,
    1.475227,
    1.491227,
    1.523227,
    1.565227,
    1.637227,
    1.683227,
    1.769227,
    1.797227,
    1.839227,
    1.873227,
    1.909227,
    1.925227,
    1.979227,
    2.033227,
    2.061227,
    2.095227,
    2.179227,
    2.181227,
    2.193227,
    2.225227,
    2.203227,
    2.333227
};

const float compass_frequency_mag1_y_offsets[] ={
    0.0,
    0.0,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5,
    0.5
};

const float compass_frequency_mag1_z_offsets[] ={
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    -0.146568,
    -0.271137,
    -0.299705,
    -0.414274,
    -0.608842,
    -0.654842,
    -0.594842,
    -0.692842,
    -0.780842,
    -0.732842,
    -0.692842,
    -1.048842,
    -1.110842,
    -1.182842,
    -0.942842,
    -1.372842
};


const float compass_frequency_mag2_x_offsets[] ={
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    -0.087374,
    -0.100747,
    -0.194121,
    -0.255494,
    -0.286868,
    -0.272868,
    -0.346868,
    -0.336868,
    -0.378868,
    -0.434868,
    -0.442868,
    -0.428868,
    -0.458868,
    -0.488868,
    -0.490868,
    -0.528868,
    -0.590868,
    -0.616868,
    -0.624868,
    -0.710868,
    -0.830868,
    -0.906868,
    -0.944868,
    -0.964868,
    -1.030868,
    -1.044868,
    -1.024868,
    -1.098868,
    -1.176868,
    -1.202868,
    -1.294868,
    -1.404868,
    -1.462868,
    -1.472868,
    -1.534868,
    -1.488868,
    -1.474868,
    -1.528868,
    -1.646868,
    -1.688868,
    -1.780868,
    -1.952868,
    -1.994868,
    -2.070868,
    -2.156868,
    -2.286868,
    -2.318868,
    -2.426868,
    -2.562868,
    -2.718868,
    -2.794868,
    -2.938868,
    -3.070868,
    -3.106868,
    -3.228868,
    -3.396868,
    -3.494868,
    -3.676868,
    -3.794868,
    -3.910868,
    -4.040868,
    -4.220868,
    -4.288868,
    -4.602868,
    -4.814868,
    -4.960868,
    -5.212868,
    -5.486868,
    -5.538868,
    -5.602868,
    -5.886868,
    -6.002868,
    -6.232868,
    -6.456868,
    -6.724868,
    -6.840868,
    -7.054868,
    -7.142868,
    -7.376868,
    -7.516868,
    -7.668868,
    -7.676868,
    -7.966868,
};

const float compass_frequency_mag2_y_offsets[] ={
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    -0.038916,
    -0.087833,
    -0.158749,
    -0.239666,
    -0.406582,
    -0.548582,
    -0.614582,
    -0.634582,
    -0.656582,
    -0.612582,
    -0.574582,
    -0.638582,
    -0.706582,
    -0.814582,
    -0.910582,
    -1.002582,
    -1.054582,
    -1.132582,
    -1.174582,
    -1.278582,
    -1.334582,
    -1.422582,
    -1.498582,
    -1.628582,
    -1.716582,
    -1.888582,
    -2.002582,
    -2.154582,
    -2.262582,
    -2.306582,
    -2.352582,
    -2.470582,
    -2.608582,
    -2.724582,
    -2.926582,
    -3.070582,
    -3.220582,
    -3.318582,
    -3.362582,
    -3.398582,
    -3.454582,
    -3.570582,
    -3.698582,
    -3.874582,
    -4.126582,
    -4.406582,
    -4.514582,
    -4.758582,
    -5.106582,
    -5.300582,
    -5.554582,
    -5.876582,
    -6.148582,
    -6.184582,
    -6.388582,
    -6.592582,
    -6.816582,
    -7.010582,
    -7.436582,
    -7.826582,
    -8.074582,
    -8.324582,
    -8.614582,
    -8.778582,
    -8.854582,
    -9.004582,
    -9.044582
};

const float compass_frequency_mag2_z_offsets[] = {
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    0.000000,
    -0.029358,
    -0.088716,
    -0.182074,
    -0.301432,
    -0.460790,
    -0.614790,
    -0.744790,
    -0.826790,
    -0.872790,
    -0.892790,
    -0.850790,
    -0.828790,
    -0.932790,
    -1.054790,
    -1.062790,
    -1.090790,
    -1.012790,
    -0.886790,
    -0.830790,
    -0.934790,
    -1.108790,
    -1.314790,
    -1.474790,
    -1.562790,
    -1.632790,
    -1.754790,
    -1.946790,
    -2.134790,
    -2.362790,
    -2.530790,
    -2.608790,
    -2.564790,
    -2.494790,
    -2.534790,
    -2.604790,
    -2.656790,
    -2.912790,
    -3.196790,
    -3.314790,
    -3.498790,
    -3.690790,
    -3.786790,
    -3.908790,
    -3.938790,
    -4.006790,
    -4.012790,
    -4.104790,
    -4.242790,
    -4.486790,
    -4.694790,
    -5.026790,
    -5.386790,
    -5.628790,
    -5.834790,
    -6.126790,
    -6.388790,
    -6.550790,
    -6.746790,
    -6.978790,
    -7.202790,
    -7.372790,
    -7.444790,
    -7.662790,
    -8.024790,
    -8.224790,
    -8.616790,
    -9.038790,
    -9.432790,
    -9.650790,
    -10.012790,
    -10.252790,
    -10.714790,
    -10.952790,
    -11.372790,
    -11.634790,
    -12.098790,
    -12.350790,
    -12.804790,
    -13.338790,
    -13.888790,
    -14.366790,
    -14.930790,
    -15.450790,
    -15.966790,
    -16.606790,
    -16.978790,
    -17.540790,
    -18.108790,
    -18.298790,
    -19.026790,
    -18.286790
};

float average_rpm = 0.0f;
float mag1_x_offset = 0.0f;
float mag1_y_offset = 0.0f;
float mag1_z_offset = 0.0f;
float mag2_x_offset = 0.0f;
float mag2_y_offset = 0.0f;
float mag2_z_offset = 0.0f;

// float magnetometer_rotation_matrix[3][3] = {
//     {1.0, 0.0, 0.0},
//     {0.0, 1.0, 0.0},
//     {0.0, 0.0, 1.0}
// };

// float magnetometer_rotation_matrix1[3][3] = {
//     {1.0, 0.0, 0.0},
//     {0.0, 1.0, 0.0},
//     {0.0, 0.0, 1.0}
// };

// float magnetometer_rotation_matrix2[3][3] = {
//     {1.0, 0.0, 0.0},
//     {0.0, 1.0, 0.0},
//     {0.0, 0.0, 1.0}
// };



int main(void){
    init_STM32_peripherals();
    accelerometer_roll_offset = base_accelerometer_roll_offset;
    accelerometer_pitch_offset = base_accelerometer_pitch_offset;
    // Turn off the blue led. Will show the status of sd logging later
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
    printf("STARTING PROGRAM\n"); 
    
