Rokasbarasa1/STM32-Quadcopter/src/main.c
    }
    sensors7 = DWT->CYCCNT;

    // Dynamic notch filtering
    // Not currently used

    // For testing
    if(txt_logging_mode == 4){
        // Keep some unfiltered data
        magnetometer_data_unfiltered[0] = magnetometer_data[0];
        magnetometer_data_unfiltered[1] = magnetometer_data[1];
        magnetometer_data_unfiltered[2] = magnetometer_data[2];
        
        magnetometer_data_ist8310_unfiltered[0] = magnetometer_data_ist8310[0];
        magnetometer_data_ist8310_unfiltered[1] = magnetometer_data_ist8310[1];
        magnetometer_data_ist8310_unfiltered[2] = magnetometer_data_ist8310[2];

        
        if(got_ist8310_reading){
            magnetometer_data_ist8310[0] = low_pass_filter_biquad_read(&filter_magnetometer_ist8310_x, magnetometer_data_ist8310[0]);
            magnetometer_data_ist8310[1] = low_pass_filter_biquad_read(&filter_magnetometer_ist8310_y, magnetometer_data_ist8310[1]);
            magnetometer_data_ist8310[2] = low_pass_filter_biquad_read(&filter_magnetometer_ist8310_z, magnetometer_data_ist8310[2]);
        }
    }

    // Filter magnetometer data

    magnetometer_data[0] = low_pass_filter_biquad_read(&filter_magnetometer_x, magnetometer_data[0]);
    magnetometer_data[1] = low_pass_filter_biquad_read(&filter_magnetometer_y, magnetometer_data[1]);
    magnetometer_data[2] = low_pass_filter_biquad_read(&filter_magnetometer_z, magnetometer_data[2]);

    magnetometer_data_secondary[0] = low_pass_filter_biquad_read(&filter_magnetometer_x_secondary, magnetometer_data_secondary[0]);
    magnetometer_data_secondary[1] = low_pass_filter_biquad_read(&filter_magnetometer_y_secondary, magnetometer_data_secondary[1]);
    magnetometer_data_secondary[2] = low_pass_filter_biquad_read(&filter_magnetometer_z_secondary, magnetometer_data_secondary[2]);


    magnetometer_data_raw[0] = magnetometer_data[0];
    magnetometer_data_raw[1] = magnetometer_data[1];
    magnetometer_data_raw[2] = magnetometer_data[2];

    magnetometer_data_secondary_raw[0] = magnetometer_data_secondary[0];
    magnetometer_data_secondary_raw[1] = magnetometer_data_secondary[1];
    magnetometer_data_secondary_raw[2] = magnetometer_data_secondary[2];
    // magnetometer_data[0] = outlier_detection_process(&outlier_detection_magnetometer_x, magnetometer_data[0]);
    // magnetometer_data[1] = outlier_detection_process(&outlier_detection_magnetometer_y, magnetometer_data[1]);
    // magnetometer_data[2] = outlier_detection_process(&outlier_detection_magnetometer_z, magnetometer_data[2]);

    // magnetometer_data[0] = iir_filter_process(&iir_filter_magnetometer_x, magnetometer_data[0]);
    // magnetometer_data[1] = iir_filter_process(&iir_filter_magnetometer_y, magnetometer_data[1]);
    // magnetometer_data[2] = iir_filter_process(&iir_filter_magnetometer_z, magnetometer_data[2]);

    // magnetometer_data[0] = moving_average_process(&moving_average_magnetometer_x, magnetometer_data[0]);
    // magnetometer_data[1] = moving_average_process(&moving_average_magnetometer_y, magnetometer_data[1]);
    // magnetometer_data[2] = moving_average_process(&moving_average_magnetometer_z, magnetometer_data[2]);




    // Yaw Angular rotation filtering
    gyro_angular[2] = low_pass_filter_pt1_read(&filter_gyro_z, gyro_angular[2]);

    // Filter accelerometer data
    acceleration_data[0] = low_pass_filter_biquad_read(&biquad_filter_accelerometer_x, acceleration_data[0]);
    acceleration_data[1] = low_pass_filter_biquad_read(&biquad_filter_accelerometer_y, acceleration_data[1]);
    acceleration_data[2] = low_pass_filter_biquad_read(&biquad_filter_accelerometer_z, acceleration_data[2]);

    // Additional gyro filtering for d term
    // Adjust the filter cutoff 
    low_pass_filter_biquad_set_cutoff_frequency(
        &roll_d_term_filtering, 
        map_value_to_expo_range_inverted(
            throttle, 
            d_term_filtering_min_cutoff,
            d_term_filtering_max_cutoff,
            d_term_filtering_expo
        )
    ); // Use throttle, not the final output of the motor
    low_pass_filter_biquad_set_cutoff_frequency_using_reference_filter(&pitch_d_term_filtering, &roll_d_term_filtering);
    gyro_angular_for_d_term[0] = low_pass_filter_biquad_read(&roll_d_term_filtering, gyro_angular[0]);
    gyro_angular_for_d_term[1] = low_pass_filter_biquad_read(&pitch_d_term_filtering, gyro_angular[1]);

    sensors8 = DWT->CYCCNT;

    altitude_barometer = low_pass_filter_biquad_read(&altitude_barometer_filtering, altitude_barometer);

    // ------------------------------------------------------------------------------------------------------ Sensor fusion
    calculate_roll_pitch_from_accelerometer_data(acceleration_data, &accelerometer_roll, &accelerometer_pitch, accelerometer_roll_offset, accelerometer_pitch_offset); // Get roll and pitch from the data. I call it x and y. Ranges -90 to 90. 
    sensor_fusion_roll_pitch(gyro_angular, accelerometer_roll, accelerometer_pitch, loop_start_timestamp_microseconds, 1, imu_orientation);

    // Main objectives
    // Rotation
    // Tilt compensation
    // FIltering
    // DIfferent sensors


    // Ttime
    // Gyro yaw
    get_gyro_yaw(gyro_angular, loop_start_timestamp_microseconds, 1, &gyro_yaw);


    // Apply mag offsets


    if(use_compass_rpm){
        average_rpm = (motor_frequency[0]+motor_frequency[1]+motor_frequency[2]+motor_frequency[3])/4.0f;

        mag1_x_offset = (-1) * calculate_mag_offset_using_compass_rpm(average_rpm, compass_frequency_frequency_samples, compass_frequency_mag1_x_offsets, compass_frequency_values_amount);
        mag1_y_offset = (-1) * calculate_mag_offset_using_compass_rpm(average_rpm, compass_frequency_frequency_samples, compass_frequency_mag1_y_offsets, compass_frequency_values_amount);
        mag1_z_offset = (-1) * calculate_mag_offset_using_compass_rpm(average_rpm, compass_frequency_frequency_samples, compass_frequency_mag1_z_offsets, compass_frequency_values_amount);

        mag2_x_offset = (-1) * calculate_mag_offset_using_compass_rpm(average_rpm, compass_frequency_frequency_samples, compass_frequency_mag2_x_offsets, compass_frequency_values_amount);
        mag2_y_offset = (-1) * calculate_mag_offset_using_compass_rpm(average_rpm, compass_frequency_frequency_samples, compass_frequency_mag2_y_offsets, compass_frequency_values_amount);
        mag2_z_offset = (-1) * calculate_mag_offset_using_compass_rpm(average_rpm, compass_frequency_frequency_samples, compass_frequency_mag2_z_offsets, compass_frequency_values_amount);


        magnetometer_data[0] = magnetometer_data[0] + mag1_x_offset;
        magnetometer_data[1] = magnetometer_data[1] + mag1_y_offset;
        magnetometer_data[2] = magnetometer_data[2] + mag1_z_offset;

        magnetometer_data_secondary[0] = magnetometer_data_secondary[0] + mag2_x_offset;
        magnetometer_data_secondary[1] = magnetometer_data_secondary[1] + mag2_y_offset;
        magnetometer_data_secondary[2] = magnetometer_data_secondary[2] + mag2_z_offset;
    }




