Rokasbarasa1/STM32-Quadcopter/src/main.c
    // X bmm350 yaw rotated tilt
    calculate_yaw_tilt_compensated_using_magnetometer_data(magnetometer_data, &magnetometer_yaw, imu_orientation[0], imu_orientation[1], yaw_offset);
    calculate_yaw_tilt_compensated_using_magnetometer_data(magnetometer_data_secondary, &magnetometer_yaw_secondary, -imu_orientation[1], imu_orientation[0], yaw_offset + 90.0);


    if(txt_logging_mode == 4){
        // magnetometer_rotation_matrix

        // float magnetometer_data_matrix_rotate[3];
        // float magnetometer_data_matrix_rotate1[3];
        // float magnetometer_data_matrix_rotate2[3];

        // magnetometer_data_matrix_rotate[0] = magnetometer_data_secondary[0];
        // magnetometer_data_matrix_rotate[1] = magnetometer_data_secondary[1];
        // magnetometer_data_matrix_rotate[2] = magnetometer_data_secondary[2];

        // magnetometer_data_matrix_rotate1[0] = magnetometer_data_secondary[0];
        // magnetometer_data_matrix_rotate1[1] = magnetometer_data_secondary[1];
        // magnetometer_data_matrix_rotate1[2] = magnetometer_data_secondary[2];

        // magnetometer_data_matrix_rotate2[0] = magnetometer_data_secondary[0];
        // magnetometer_data_matrix_rotate2[1] = magnetometer_data_secondary[1];
        // magnetometer_data_matrix_rotate2[2] = magnetometer_data_secondary[2];


        // rotate_magnetometer_inplace(magnetometer_rotation_matrix, magnetometer_data_matrix_rotate);
        // rotate_magnetometer_inplace(magnetometer_rotation_matrix1, magnetometer_data_matrix_rotate1);
        // rotate_magnetometer_inplace(magnetometer_rotation_matrix2, magnetometer_data_matrix_rotate2);


        // bmm350 yaw unrotated no tilt
        calculate_yaw_using_magnetometer_data(magnetometer_data, &magnetometer_yaw_unrotated_no_tilt, 0.0f);

        // bmm350 yaw unrotated tilt
        calculate_yaw_tilt_compensated_using_magnetometer_data(magnetometer_data, &magnetometer_yaw_unrotated_tilt, imu_orientation[0], imu_orientation[1], 0.0f);

        // bmm350 yaw rotated no tilt
        calculate_yaw_using_magnetometer_data(magnetometer_data, &magnetometer_yaw_no_tilt, yaw_offset);

        
        // Roll and pitch rotated 90 degrees
        // calculate_yaw_tilt_compensated_using_magnetometer_data(magnetometer_data_matrix_rotate, &magnetometer_yaw_90, imu_orientation[0], imu_orientation[1], yaw_offset);
        // calculate_yaw_tilt_compensated_using_magnetometer_data(magnetometer_data_matrix_rotate1, &magnetometer_yaw_180, imu_orientation[0], imu_orientation[1], yaw_offset);
        // calculate_yaw_tilt_compensated_using_magnetometer_data(magnetometer_data_matrix_rotate2, &magnetometer_yaw_270, imu_orientation[0], imu_orientation[1], yaw_offset);

        calculate_yaw_tilt_compensated_using_magnetometer_data(magnetometer_data, &magnetometer_yaw_90, -imu_orientation[1], imu_orientation[0], yaw_offset);
        calculate_yaw_tilt_compensated_using_magnetometer_data(magnetometer_data, &magnetometer_yaw_180, -imu_orientation[0], -imu_orientation[1], yaw_offset);
        calculate_yaw_tilt_compensated_using_magnetometer_data(magnetometer_data, &magnetometer_yaw_270, imu_orientation[1], -imu_orientation[0], yaw_offset);
        
        // calculate_yaw_tilt_compensated_using_magnetometer_data(magnetometer_data_matrix_rotate, &magnetometer_yaw_90, -imu_orientation[1], imu_orientation[0], yaw_offset + 90.0);
        // calculate_yaw_tilt_compensated_using_magnetometer_data(magnetometer_data_matrix_rotate1, &magnetometer_yaw_180, -imu_orientation[1], imu_orientation[0], yaw_offset + 90.0);
        // calculate_yaw_tilt_compensated_using_magnetometer_data(magnetometer_data_matrix_rotate2, &magnetometer_yaw_270, -imu_orientation[1], imu_orientation[0], yaw_offset + 90.0);

        
        // bmm350 yaw rotated unfiltered no tilt
        calculate_yaw_using_magnetometer_data(magnetometer_data_unfiltered, &magnetometer_yaw_unfiltered_no_tilt, yaw_offset);


        // ist8310 yaw unrotated no tilt
        calculate_yaw_using_magnetometer_data(magnetometer_data_ist8310, &magnetometer_ist8310_yaw_unrotated_no_tilt, 0.0f);

        // ist8310 yaw unrotated tilt
        calculate_yaw_tilt_compensated_using_magnetometer_data(magnetometer_data_ist8310, &magnetometer_ist8310_yaw_unrotated_tilt, imu_orientation[0], imu_orientation[1], 0.0f);

        // ist8310 yaw rotated no tilt
        calculate_yaw_using_magnetometer_data(magnetometer_data_ist8310, &magnetometer_ist8310_yaw_no_tilt, yaw_offset);

        // ist8310 yaw rotated tilt
        calculate_yaw_tilt_compensated_using_magnetometer_data(magnetometer_data_ist8310, &magnetometer_ist8310_yaw, imu_orientation[0], imu_orientation[1], yaw_offset);

        // ist8310 yaw rotated unfiltered no tilt
        calculate_yaw_using_magnetometer_data(magnetometer_data_ist8310_unfiltered, &magnetometer_ist8310_yaw_unfiltered_no_tilt, yaw_offset);
    }


    // // Set new yaw after some time
    // if(initial_yaw_set == 0 && get_absolute_time() - yaw_loop_start_timestamp > yaw_set_yaw_after_microseconds_of_loop){
    //     initial_yaw_set = 1;
    //     imu_orientation[2] = magnetometer_yaw;
    //     gyro_yaw = magnetometer_yaw;
    //     gyro_yaw_old = magnetometer_yaw_old;
    // }

    // acceleration_data_previous[0] = acceleration_data[0];
    // acceleration_data_previous[1] = acceleration_data[1];
    // acceleration_data_previous[2] = acceleration_data[2];

    // if (!initial_yaw_set) {
    //     // float gyro_magnitude = sqrtf(
    //     //     gyro_angular[0] * gyro_angular[0] +
    //     //     gyro_angular[1] * gyro_angular[1] +
    //     //     gyro_angular[2] * gyro_angular[2]
    //     // );

    //     // float accel_change = sqrtf(
    //     //     (acceleration_data[0] - acceleration_data_previous[0]) * (acceleration_data[0] - acceleration_data_previous[0]) +
    //     //     (acceleration_data[1] - acceleration_data_previous[1]) * (acceleration_data[1] - acceleration_data_previous[1]) +
    //     //     (acceleration_data[2] - acceleration_data_previous[2]) * (acceleration_data[2] - acceleration_data_previous[2])
    //     // );

    //     if (fabs(imu_orientation[0]) < 0.2f &&  // roll < 3°
    //         fabs(imu_orientation[1]) < 0.2f)  // pitch < 3°
    //     {
    //     // if (fabs(imu_orientation[0]) < 0.3f &&  // roll < 3°
    //     //     fabs(imu_orientation[1]) < 0.3f &&  // pitch < 3°
    //     //     gyro_magnitude < 0.1f &&            // not rotating
    //     //     accel_change < 0.05f)               // not being bumped
    //     // {
    //         initial_yaw_set = 1;
    //         imu_orientation[2] = magnetometer_yaw;
    //         gyro_yaw = magnetometer_yaw;
    //         gyro_yaw_old = magnetometer_yaw_old;
    //     }else{
    //         gps_target_unset_logged = 0;
    //         gps_target_unset_cause = 5;
    //         gps_can_be_used = 0;
    //     }
    // }


