Rokasbarasa1/STM32-Quadcopter/src/main.c
    throttle_value_FR = setServoActivationPercent(motor_power[2], actual_min_dshot600_throttle_value, actual_max_dshot600_throttle_value);
    throttle_value_FL = setServoActivationPercent(motor_power[3], actual_min_dshot600_throttle_value, actual_max_dshot600_throttle_value);
    throttle_value_BL = setServoActivationPercent(motor_power[0], actual_min_dshot600_throttle_value, actual_max_dshot600_throttle_value);
    throttle_value_BR = setServoActivationPercent(motor_power[1], actual_min_dshot600_throttle_value, actual_max_dshot600_throttle_value);

    // FPV cam side FRONT
    bdshot600_dma_set_throttle(throttle_value_FR, motor_FR); // Front-right
    bdshot600_dma_set_throttle(throttle_value_FL, motor_FL); // Front-left
    // GPS side BACK
    bdshot600_dma_set_throttle(throttle_value_BL, motor_BL); // Back-left
    bdshot600_dma_set_throttle(throttle_value_BR, motor_BR); // Back-right

    // For logging
    motor_power[0] = throttle_value_BL; // Logging BL <- BL
    motor_power[1] = throttle_value_FL; // Logging FL <- FL
    motor_power[2] = throttle_value_BR; // Logging BR <- BR
    motor_power[3] = throttle_value_FR; // Logging FR <- FR

    motor6 = DWT->CYCCNT;

    // If manual mode is on. Immediately after getting the motor values, send them to motors.
    if(manual_bdshot) bdshot600_dma_send_all_motor_data();
    motor7 = DWT->CYCCNT;
}

void handle_radio_communication(){
    __disable_irq();
    if(!nrf24_data_available(1)){
        __enable_irq();
        return;
    }

    nrf24_receive(rx_data);
    __enable_irq();


    uint8_t rx_data_size = strlen(rx_data);

    rx_data_size = 32;
    // printf("Received: '");
    // for (size_t i = 0; i < 32; i++)
    // {
    //     printf("%c", rx_data[i]);
    // }
    // printf("'\n");
    
    // Get the type of request
    extract_request_type(rx_data, rx_data_size, rx_type);

    radio2 = DWT->CYCCNT;
    if(strcmp(rx_type, "js") == 0){
        // printf("JOYSTICK\n");
        last_signal_timestamp_microseconds = get_absolute_time();
        
        extract_joystick_request_values_float(rx_data, rx_data_size, &throttle, &yaw, &roll, &pitch);

        // Reversed
        roll = (-(roll-50.0))+50.0;

        // For the blackbox log
        remote_control[0] = roll-50.0;
        remote_control[1] = pitch-50.0;
        remote_control[2] = yaw-50.0;
        remote_control[3] = throttle+100.0;

        // the controls were inverse

        // If pitch and roll are neutral then try holding position with gps
        if(pitch == 50.0 && roll == 50.0 && gps_fix_type == 3 && use_gps_hold == 1 && gps_target_set == 0){
            gps_position_hold_enabled = 1;
            // Current gps position is the target now
            target_latitude = gps_latitude;
            target_longitude = gps_longitude;
            gps_target_set = 1;
        }else if (pitch != 50.0 || roll != 50.0 ){
            if(use_gps_reset_count >= use_gps_reset_count_to_deactivate){
                gps_position_hold_enabled = 0;
                gps_target_set = 0;
                // printf("gps unset ");

                // LOGGING
                gps_target_unset_logged = 0;
                if(roll != 50.0){
                    gps_target_unset_cause = 1;
                    gps_target_unset_roll_value = roll;
                    gps_target_unset_pitch_value = 0.0f;
                }else if(pitch != 50.0){
                    gps_target_unset_cause = 0;
                    gps_target_unset_roll_value = 0.0f;
                    gps_target_unset_pitch_value = pitch;
                }

                // printf("gps unset ");
                // if(roll != 50.0) printf("r %.1f\n", roll);
                // else if(pitch != 50.0) printf("p %.1f\n", pitch);

                // printf("GPS STATE RESET, GPS FIX %d\n", gps_fix_type);
                use_gps_reset_count = 0;
            }else{
                use_gps_reset_count++;
            }
        }

        // The remote control itself handles the deadband stuff

        // Roll ##################################################################################################################
        if(roll == 50.0){
            acro_target_roll = 0.0;
            angle_target_roll = 0.0;
        }else {
            acro_target_roll = map_value(roll, 0.0, 100.0, -acro_mode_rate_degrees_per_second, acro_mode_rate_degrees_per_second);
            angle_target_roll = map_value(roll, 0.0, 100.0, -max_roll_attack, max_roll_attack);
        }
        // Pitch ##################################################################################################################
        if(pitch == 50.0){
            acro_target_pitch = 0.0;
            angle_target_pitch = 0.0;
        }else{   
            acro_target_pitch = map_value(pitch, 0.0, 100.0, -acro_mode_rate_degrees_per_second, acro_mode_rate_degrees_per_second);
            angle_target_pitch = map_value(pitch, 0.0, 100.0, -max_pitch_attack, max_pitch_attack);
        }

        // if(flight_mode == 0){
        //     printf("Acro targets: %.2f %.2f %.2f\n", acro_target_roll, acro_target_pitch, acro_target_yaw);
        // }else if(flight_mode == 1){
        //     printf("Angle targets: %.2f %.2f\n", angle_target_roll, angle_target_pitch);
        // }

        // Yaw ##################################################################################################################
        if(yaw == 50) acro_target_yaw = 0;
        else acro_target_yaw = map_value(yaw, 0.0, 100.0, -max_yaw_attack, max_yaw_attack);

        // Throttle ##################################################################################################################

        // Throttle is handled every loop in post remote function
    }else if(strcmp(rx_type, "pid") == 0){
        printf("Got pid change\n");
        
        float added_proportional = 0;
        float added_integral = 0;
        float added_derivative = 0;
        float added_master_gain = 0;

        extract_pid_request_values(rx_data, strlen(rx_data), &added_proportional, &added_integral, &added_derivative, &added_master_gain);


        if(pid_change_mode == 0){ // Acro mode change
            acro_roll_pitch_gain_p = BASE_ACRO_roll_pitch_GAIN_P + added_proportional;
            acro_roll_pitch_gain_i = BASE_ACRO_roll_pitch_GAIN_I + added_integral;
            acro_roll_pitch_gain_d = BASE_ACRO_roll_pitch_GAIN_D + added_derivative;
            acro_roll_pitch_master_gain = BASE_ACRO_roll_pitch_MASTER_GAIN + added_master_gain;

            added_acro_roll_pitch_gain_p = added_proportional;
            added_acro_roll_pitch_gain_i = added_integral;
            added_acro_roll_pitch_gain_d = added_derivative;
            added_acro_roll_pitch_master_gain = added_master_gain;

            // Configure the roll pid 
            pid_set_proportional_gain(&acro_roll_pid, acro_roll_pitch_gain_p * acro_roll_pitch_master_gain);
            pid_set_integral_gain(&acro_roll_pid, acro_roll_pitch_gain_i * acro_roll_pitch_master_gain);
            pid_set_derivative_gain(&acro_roll_pid, acro_roll_pitch_gain_d * acro_roll_pitch_master_gain);
            pid_reset_integral_sum(&acro_roll_pid);

            // Configure the pitch pid 
            pid_set_proportional_gain(&acro_pitch_pid, acro_roll_pitch_gain_p * acro_roll_pitch_master_gain);
            pid_set_integral_gain(&acro_pitch_pid, acro_roll_pitch_gain_i * acro_roll_pitch_master_gain);
            pid_set_derivative_gain(&acro_pitch_pid, acro_roll_pitch_gain_d * acro_roll_pitch_master_gain);
            pid_reset_integral_sum(&acro_pitch_pid);
            printf("Changed PID of acro mode\n");
        }else if(pid_change_mode == 1){ // Angle mode change
            angle_roll_pitch_gain_p = BASE_ANGLE_roll_pitch_GAIN_P + added_proportional;
            angle_roll_pitch_gain_i = BASE_ANGLE_roll_pitch_GAIN_I + added_integral;
            angle_roll_pitch_gain_d = BASE_ANGLE_roll_pitch_GAIN_D + added_derivative;
            angle_roll_pitch_master_gain = BASE_ANGLE_roll_pitch_MASTER_GAIN + added_master_gain;

