Rokasbarasa1/STM32-Quadcopter/src/main.c
            added_angle_roll_pitch_gain_p = added_proportional;
            added_angle_roll_pitch_gain_i = added_integral;
            added_angle_roll_pitch_gain_d = added_derivative;
            added_angle_roll_pitch_master_gain = added_master_gain;

            // Configure the pitch pid 
            pid_set_proportional_gain(&angle_pitch_pid, angle_roll_pitch_gain_p * angle_roll_pitch_master_gain);
            pid_set_integral_gain(&angle_pitch_pid, angle_roll_pitch_gain_i * angle_roll_pitch_master_gain);
            pid_set_derivative_gain(&angle_pitch_pid, angle_roll_pitch_gain_d * angle_roll_pitch_master_gain);
            pid_reset_integral_sum(&angle_pitch_pid);

            // Configure the roll pid 
            pid_set_proportional_gain(&angle_roll_pid, angle_roll_pitch_gain_p * angle_roll_pitch_master_gain);
            pid_set_integral_gain(&angle_roll_pid, angle_roll_pitch_gain_i * angle_roll_pitch_master_gain);
            pid_set_derivative_gain(&angle_roll_pid, angle_roll_pitch_gain_d * angle_roll_pitch_master_gain);
            pid_reset_integral_sum(&angle_roll_pid);
            printf("Changed PID of angle mode\n");
        }else if(pid_change_mode == 2){ // Both depending on flight mode

            if(flight_mode == 1){ // ACRO MODE
                acro_roll_pitch_gain_p = BASE_ACRO_roll_pitch_GAIN_P + added_proportional;
                acro_roll_pitch_gain_i = BASE_ACRO_roll_pitch_GAIN_I + added_integral;
                acro_roll_pitch_gain_d = BASE_ACRO_roll_pitch_GAIN_D + added_derivative;
                acro_roll_pitch_master_gain = BASE_ACRO_roll_pitch_MASTER_GAIN + added_master_gain;

                added_acro_roll_pitch_gain_p = added_proportional;
                added_acro_roll_pitch_gain_i = added_integral;
                added_acro_roll_pitch_gain_d = added_derivative;
                added_acro_roll_pitch_master_gain = added_master_gain;

                // Configure the roll pid 
                pid_set_proportional_gain(&acro_roll_pid, acro_roll_pitch_gain_p * acro_roll_pitch_master_gain);
                pid_set_integral_gain(&acro_roll_pid, acro_roll_pitch_gain_i * acro_roll_pitch_master_gain);
                pid_set_derivative_gain(&acro_roll_pid, acro_roll_pitch_gain_d * acro_roll_pitch_master_gain);
                pid_reset_integral_sum(&acro_roll_pid);

                // Configure the pitch pid 
                pid_set_proportional_gain(&acro_pitch_pid, acro_roll_pitch_gain_p * acro_roll_pitch_master_gain);
                pid_set_integral_gain(&acro_pitch_pid, acro_roll_pitch_gain_i * acro_roll_pitch_master_gain);
                pid_set_derivative_gain(&acro_pitch_pid, acro_roll_pitch_gain_d * acro_roll_pitch_master_gain);
                pid_reset_integral_sum(&acro_pitch_pid);
                printf("Changed PID of acro mode\n");
            }else if(flight_mode == 2){ // ANGLE MODE
                angle_roll_pitch_gain_p = BASE_ANGLE_roll_pitch_GAIN_P + added_proportional;
                angle_roll_pitch_gain_i = BASE_ANGLE_roll_pitch_GAIN_I + added_integral;
                angle_roll_pitch_gain_d = BASE_ANGLE_roll_pitch_GAIN_D + added_derivative;
                angle_roll_pitch_master_gain = BASE_ANGLE_roll_pitch_MASTER_GAIN + added_master_gain;

                added_angle_roll_pitch_gain_p = added_proportional;
                added_angle_roll_pitch_gain_i = added_integral;
                added_angle_roll_pitch_gain_d = added_derivative;
                added_angle_roll_pitch_master_gain = added_master_gain;

                // Configure the pitch pid 
                pid_set_proportional_gain(&angle_pitch_pid, angle_roll_pitch_gain_p * angle_roll_pitch_master_gain);
                pid_set_integral_gain(&angle_pitch_pid, angle_roll_pitch_gain_i * angle_roll_pitch_master_gain);
                pid_set_derivative_gain(&angle_pitch_pid, angle_roll_pitch_gain_d * angle_roll_pitch_master_gain);
                pid_reset_integral_sum(&angle_pitch_pid);

                // Configure the roll pid 
                pid_set_proportional_gain(&angle_roll_pid, angle_roll_pitch_gain_p * angle_roll_pitch_master_gain);
                pid_set_integral_gain(&angle_roll_pid, angle_roll_pitch_gain_i * angle_roll_pitch_master_gain);
                pid_set_derivative_gain(&angle_roll_pid, angle_roll_pitch_gain_d * angle_roll_pitch_master_gain);
                pid_reset_integral_sum(&angle_roll_pid);
                printf("Changed PID of angle mode\n");
            }else if(flight_mode == 3){ // Alitude hold
                altitude_hold_gain_p = BASE_ALTITUDE_HOLD_GAIN_P + added_proportional;
                altitude_hold_gain_i = BASE_ALTITUDE_HOLD_GAIN_I + added_integral;
                altitude_hold_gain_d = BASE_ALTITUDE_HOLD_GAIN_D + added_derivative;
                altitude_hold_master_gain = BASE_ALTITUDE_HOLD_MASTER_GAIN + added_master_gain;

                added_altitude_hold_gain_p = added_proportional;
                added_altitude_hold_gain_i = added_integral;
                added_altitude_hold_gain_d = added_derivative;
                added_altitude_hold_master_gain = added_master_gain;

                // Configure the pitch pid 
                pid_set_proportional_gain(&altitude_hold_pid, altitude_hold_gain_p * altitude_hold_master_gain);
                pid_set_integral_gain(&altitude_hold_pid, altitude_hold_gain_i * altitude_hold_master_gain);
                pid_set_derivative_gain(&altitude_hold_pid, altitude_hold_gain_d * altitude_hold_master_gain);
                pid_reset_integral_sum(&altitude_hold_pid);
                printf("Changed PID of altitude hold\n");
            }else if(flight_mode == 4 || flight_mode == 5){ // GPS hold
                gps_hold_gain_p = BASE_GPS_HOLD_GAIN_P + added_proportional;
                gps_hold_gain_i = BASE_GPS_HOLD_GAIN_I + added_integral;
                gps_hold_gain_d = BASE_GPS_HOLD_GAIN_D + added_derivative;
                gps_hold_master_gain = BASE_GPS_HOLD_MASTER_GAIN + added_master_gain;

                added_gps_hold_gain_p = added_proportional;
                added_gps_hold_gain_i = added_integral;
                added_gps_hold_gain_d = added_derivative;
                added_gps_hold_master_gain = added_master_gain;

                // Configure the pitch pid 
                pid_set_proportional_gain(&gps_latitude_pid, gps_hold_gain_p * gps_hold_master_gain);
                pid_set_integral_gain(&gps_latitude_pid, gps_hold_gain_i * gps_hold_master_gain);
                pid_set_derivative_gain(&gps_latitude_pid, gps_hold_gain_d * gps_hold_master_gain);
                pid_reset_integral_sum(&gps_latitude_pid);

                // Configure the roll pid 
                pid_set_proportional_gain(&gps_longitude_pid, gps_hold_gain_p * gps_hold_master_gain);
                pid_set_integral_gain(&gps_longitude_pid, gps_hold_gain_i * gps_hold_master_gain);
                pid_set_derivative_gain(&gps_longitude_pid, gps_hold_gain_d * gps_hold_master_gain);
                pid_reset_integral_sum(&gps_longitude_pid);
                printf("Changed PID of GPS hold\n");
            }
        }


        // Start new log blackbox log file if one was running.
        if(sd_card_initialized && use_blackbox_logging){
            // Add end of file to the current file
            uint16_t string_length = 0;
            char *betaflight_end_file_string = betaflight_blackbox_get_end_of_log(&string_length);

            char* sd_card_buffer = (uint8_t*)sd_card_get_buffer_pointer(1);
            uint16_t sd_card_buffer_index = 0;
            uint16_t betaflight_data_string_index = 0;
            while(sd_card_buffer_index < string_length){
                sd_card_buffer[sd_card_buffer_index] = betaflight_end_file_string[sd_card_buffer_index];
                sd_card_buffer_increment_index();
                sd_card_buffer_index++;
                betaflight_data_string_index++;
            }
            free(betaflight_end_file_string);



            if(use_simple_async){
                sd_special_write_chunk_of_string_data_no_slave_response(sd_card_get_buffer_pointer(1));
                sd_buffer_clear(1);
            }else{
                if(use_blackbox_logging){
                    sd_special_write_chunk_of_byte_data_async(sd_card_get_buffer_pointer(1), string_length);
                    sd_buffer_swap();
                    sd_buffer_clear(1);
                }else{
                    sd_special_write_chunk_of_string_data_async(sd_card_get_buffer_pointer(1));
                    sd_buffer_swap();
                    sd_buffer_clear(1);
                }
            }

            printf("SD logging: Sent file ending\n");

