Rokasbarasa1/STM32-Quadcopter/src/main.c
            printf("SD logging: Waiting for writing and slave ready\n");
            sd_card_wait_for_dma_transfer_complete();
            sd_card_wait_for_slave_ready();
            if(blackbox_write_repeat_logs_in_same_file){
                sd_card_wait_for_dma_transfer_complete();
                sd_card_wait_for_slave_ready();

                uint8_t* sd_card_buffer = sd_card_get_buffer_pointer(1);
                uint16_t betaflight_header_length = 0;
                betaflight_blackbox_wrapper_get_header(
                    REFRESH_RATE_HZ,
                    acro_roll_pitch_gain_p * acro_roll_pitch_master_gain,
                    acro_roll_pitch_gain_i * acro_roll_pitch_master_gain,
                    acro_roll_pitch_gain_d * acro_roll_pitch_master_gain,
                    acro_roll_pitch_gain_p * acro_roll_pitch_master_gain,
                    acro_roll_pitch_gain_i * acro_roll_pitch_master_gain,
                    acro_roll_pitch_gain_d * acro_roll_pitch_master_gain,
                    acro_yaw_gain_p,
                    acro_yaw_gain_i,
                    0,
                    angle_roll_pitch_gain_p * angle_roll_pitch_master_gain,
                    angle_roll_pitch_gain_i * angle_roll_pitch_master_gain,
                    angle_roll_pitch_gain_d * angle_roll_pitch_master_gain,
                    altitude_hold_gain_p * altitude_hold_master_gain,
                    altitude_hold_gain_i * altitude_hold_master_gain,
                    altitude_hold_gain_d * altitude_hold_master_gain,
                    gps_hold_gain_p * gps_hold_master_gain,
                    gps_hold_gain_i * gps_hold_master_gain,
                    gps_hold_gain_d * gps_hold_master_gain,
                    filter_gyro_z_yaw_cutoff_frequency,
                    25, // Integral windup
                    21, // Gyro lowpass cutoff
                    20, // Accelerometer lowpass cutoff
                    dshot_refresh_rate,
                    min_dshot600_throttle_value,
                    max_dshot600_throttle_value,
                    actual_min_dshot600_throttle_value,
                    actual_max_dshot600_throttle_value,
                    d_term_filtering_expo,
                    rpm_notch_filter_q_harmonic_1,
                    rpm_notch_filter_min_frequency,
                    d_term_filtering_min_cutoff,
                    d_term_filtering_max_cutoff,
                    d_term_filtering_expo,
                    &betaflight_header_length,
                    sd_card_buffer,
                    10000,
                    blackbox_debug_mode,
                    COMPLEMENTARY_RATIO_MULTIPLYER_FLIGHT
                );
                
                sd_card_buffer_increment_index_by_amount(betaflight_header_length);
                HAL_Delay(1000);
                sd_special_write_chunk_of_byte_data_no_slave_response(sd_card_get_buffer_pointer(1), betaflight_header_length);

                sd_buffer_swap();
                sd_buffer_clear_index(1); // Reset the index

                HAL_Delay(1000); // wait a bit for the logger to write the data into SD
                printf("SD logging: sent blackbox header\n");

                // __HAL_TIM_CLEAR_FLAG(&htim4, TIM_FLAG_UPDATE);
                // __HAL_TIM_SET_COUNTER(&htim4, 0);
                // startup_time_microseconds = get_absolute_time();
                // loop_start_miliseconds = 0;
                // startup_time_microseconds = 0;
            }else{

                
                // Exit async mode. This will close the current file also
                uint64_t i = 0;
                while(1){
                    // printf("%lu\n", i);
                    HAL_Delay(20);
                    if(sd_special_leave_async_mode()){
                        printf("SD logging: Exit async mode request\n");
                        break;
                    }
                    i++;
                }
                printf("SD logging: Left async mode\n");

                HAL_Delay(7000);
                printf("SD logging: Waited 7 s\n");


                // Initialize new_file
                setup_logging_to_sd(1);
                printf("SD logging: Initialized logging again\n");

                // Reset the loop state
                // loop_iteration = 1;
                // absolute_microseconds_since_start = 0;
                // last_signal_timestamp_microseconds = 1000000;
                // __HAL_TIM_CLEAR_FLAG(&htim4, TIM_FLAG_UPDATE);
                // __HAL_TIM_SET_COUNTER(&htim4, 0);
                // startup_time_microseconds = get_absolute_time();
                // loop_start_microseconds = 0;
                // loop_start_miliseconds = 0;
                // startup_time_microseconds = 0;
            }

            // Capture any radio messages that were sent durring the boot proccess and discard them
            for (uint8_t i = 0; i < 50; i++){
                if(nrf24_data_available(1)){
                    nrf24_receive(rx_data);
                }
            }

            // Reset the loop state
            // loop_iteration = 1;
            // absolute_microseconds_since_start = 0;
            // loop_start_microseconds = 0;
            // loop_start_miliseconds = 0;

            // startup_time_microseconds = 0;
            // delta_time = 0;
            // time_since_startup_hours = 0;
            // time_since_startup_minutes = 0;
            // time_since_startup_seconds = 0;
            // time_since_startup_ms = 0;
            // time_since_startup_microseconds = 0;

            // // Reset the timer
            // __HAL_TIM_CLEAR_FLAG(&htim4, TIM_FLAG_UPDATE);
            // __HAL_TIM_SET_COUNTER(&htim4, 0);
            // startup_time_microseconds = get_absolute_time();
            // entered_loop = 1;

            // loop_start_microseconds = __HAL_TIM_GET_COUNTER(&htim4);
            // loop_start_miliseconds = HAL_GetTick();

            // HAL_Delay((uint16_t)(minimum_signal_timing_seconds * 1000));
        }
        

    }else if(strcmp(rx_type, "remoteSyncBase") == 0){
        printf("Got remoteSyncBase\n");
        send_pid_base_info_to_remote();
    }else if(strcmp(rx_type, "remoteSyncAdded") == 0){
        printf("Got remoteSyncAdded\n");
        send_pid_added_info_to_remote();
    }else if(strcmp(rx_type, "accel") == 0){

        float added_x_axis_offset;
        float added_y_axis_offset;

