Rokasbarasa1/STM32-Quadcopter/src/main.c
                    sd_card_append_to_buffer(1, "\n", 
                        gps_target_unset_pitch_value
                    );
                }else{
                    sd_card_append_to_buffer(1, "NAN\n");
                }
            }else if(txt_logging_mode == 2){
                if(got_pressure == 1){
                    if(txt_logged_header == 0){
                        sd_card_append_to_buffer(1, "alt barometer;target alt barometer;throttle actual;throttle;P error;I error;D error;\n");
                        txt_logged_header = 1;
                    }
                    if(ms5611_reference_set == 1){
                        sd_card_append_to_buffer(1, "%.2f;%.2f;%.1f;%.1f;%.2f;%.2f;%.2f;\n", 
                            altitude_barometer,
                            target_altitude_barometer,
                            throttle_value,
                            throttle,
                            PID_proportional[3],
                            PID_integral[3],
                            PID_derivative[3]
                        );
                    }else if(ms5611_reference_set == 0){
                        // IF reference not set then dont log the data
                        sd_card_append_to_buffer(1, "0.0;0.0;0.0;0.0;0.0;0.0;0.0;\n");
                    }
                }else{
                    skip_write = 1;
                }
            }else if(txt_logging_mode == 3){
                float raw_magnetometer_data[] = {0, 0, 0};
                float raw_magnetometer_secondary_data[] = {0, 0, 0};

                bmm350_previous_raw_magetometer_readings(raw_magnetometer_data);
                mmc5603_previous_raw_magetometer_readings(raw_magnetometer_secondary_data);
                // qmc5883l_previous_raw_magetometer_readings(raw_magnetometer_data);
                // hmc5883l_previous_raw_magetometer_readings(raw_magnetometer_data);
                // if(ist8310){
                //     ist8310_previous_raw_magetometer_readings(raw_magnetometer_data);
                // }else{
                //     bmm350_previous_raw_magetometer_readings(raw_magnetometer_data);
                // }


                // sd_card_append_to_buffer(1, "%f\t%f\t%f\t\n", 
                //     raw_magnetometer_data[0],
                //     raw_magnetometer_data[1],
                //     raw_magnetometer_data[2]
                // );
                
                sd_card_append_to_buffer(1, "%f\t%f\t%f\t%f\t%f\t%f\t\n", 
                    raw_magnetometer_data[0],
                    raw_magnetometer_data[1],
                    raw_magnetometer_data[2],
                    raw_magnetometer_secondary_data[0],
                    raw_magnetometer_secondary_data[1],
                    raw_magnetometer_secondary_data[2]
                );
            }else if (txt_logging_mode == 4){
                if(txt_logged_header == 0){
                    sd_card_append_to_buffer(1, "time microseconds;gyro_yaw;magnetometer_yaw;magnetometer_yaw_90;magnetometer_yaw_180;magnetometer_yaw_270;magnetometer_yaw_secondary;gps_yaw;magnetometer_ist8310_yaw;roll;pitch;\n");
                    txt_logged_header = 1;
                }
                char abs_time_str[21];
                uint64_to_str(get_absolute_time(), abs_time_str);
                sd_card_append_to_buffer(1, "%s;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;\n",
                    abs_time_str,
                    gyro_yaw,
                    magnetometer_yaw,
                    magnetometer_yaw_90,
                    magnetometer_yaw_180,
                    magnetometer_yaw_270,
                    magnetometer_yaw_secondary,
                    gps_yaw,
                    magnetometer_ist8310_yaw,
                    imu_orientation[0],
                    imu_orientation[1]
                );
            }else if (txt_logging_mode == 5){

                if(txt_logged_header == 0){
                    sd_card_append_to_buffer(1, "time microseconds;time since last loop;\n");
                    txt_logged_header = 1;
                }


                char abs_time_str[21];
                uint64_to_str(delta_time_total_loop_time_previous_loop_microseconds, abs_time_str);

                char delta_loop_time_str[21];
                uint64_to_str(delta_time_without_waiting_from_previous_loop_microseconds, delta_loop_time_str);
                sd_card_append_to_buffer(1, "%s;%s;\n",
                    abs_time_str,
                    delta_loop_time_str
                );
            }else if (txt_logging_mode == 6){

                if(txt_logged_header == 0){
                    sd_card_append_to_buffer(1, "time microseconds;time since last loop;roll;pitch;yaw;old roll;old pitch;old yaw;gyro yaw;gyro yaw old;mag yaw;mag yaw old;mag x;mag y;mag z;mag raw x;mag raw y;mag raw z;gyro x;gyro y;gyro z;gyro x for derivative;gyro y for derivative;gyro raw x;gyro raw y;gyro raw z;accel x;accel y;accel z;accel raw x;accel raw y;accel raw z;altitude;altitude raw;\n");
                    txt_logged_header = 1;
                }

                char abs_time_str[21];
                uint64_to_str(delta_time_total_loop_time_previous_loop_microseconds, abs_time_str);

                char delta_loop_time_str[21];
                uint64_to_str(delta_time_without_waiting_from_previous_loop_microseconds, delta_loop_time_str);
                sd_card_append_to_buffer(1, "%s;%s;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.3f;%.3f;%.3f;%.3f;%.3f;%.3f;%.3f;%.3f;%.3f;%.3f;%.3f;%.3f;%.3f;%.3f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;\n",
                    abs_time_str,
                    delta_loop_time_str,
                    imu_orientation[0],
                    imu_orientation[1],
                    imu_orientation[2],
                    old_imu_orientation[0],
                    old_imu_orientation[1],
                    old_imu_orientation[2],
                    gyro_yaw,
                    gyro_yaw_old,
                    magnetometer_yaw,
                    0.0f,
                    magnetometer_data[0],
                    magnetometer_data[1],
                    magnetometer_data[2],
                    magnetometer_data_raw[0],
                    magnetometer_data_raw[1],
                    magnetometer_data_raw[2],
                    gyro_angular[0],
                    gyro_angular[1],
                    gyro_angular[2],
                    gyro_angular_for_d_term[0],
                    gyro_angular_for_d_term[1],
                    gyro_angular_raw[0],
                    gyro_angular_raw[1],
                    gyro_angular_raw[2],
                    acceleration_data[0],
                    acceleration_data[1],
                    acceleration_data[2],
                    acceleration_data_raw[0],
                    acceleration_data_raw[1],
                    acceleration_data_raw[2],
                    altitude_barometer,
                    altitude_barometer_raw
                );
            }else if (txt_logging_mode == 7){
                sd_card_append_to_buffer(1, "%f\t%f\t%f\t%f\t%f\t%f\t\n", 
                    magnetometer_data_raw[0],
                    magnetometer_data_raw[1],
                    magnetometer_data_raw[2],
                    magnetometer_data_secondary_raw[0],
                    magnetometer_data_secondary_raw[1],
                    magnetometer_data_secondary_raw[2]
                );
            }else if (txt_logging_mode == 8){

                
                if(txt_logged_header == 0){
                    sd_card_append_to_buffer(1, "motor0 rpm;motor1 rpm;motor2 rpm;motor3 rpm;mag x;mag y;mag z;mag x offset;mag y offset;mag z offset;mag raw x;mag raw y;mag raw z;mag yaw;mag2 x;mag2 y;mag2 z;mag2 x offset;mag2 y offset;mag2 z offset;mag2 raw x;mag2 raw y;mag2 raw z;mag2 yaw;gps yaw;gyro yaw;roll;pitch;avg rpm;\n");
                    txt_logged_header = 1;
                }

                sd_card_append_to_buffer(1, "%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;%.2f;\n",
                    motor_frequency[0],
                    motor_frequency[1],
                    motor_frequency[2],
                    motor_frequency[3],
                    magnetometer_data[0],
                    magnetometer_data[1],
                    magnetometer_data[2],
                    mag1_x_offset,
                    mag1_y_offset,
                    mag1_z_offset,
                    magnetometer_data_raw[0],
                    magnetometer_data_raw[1],
                    magnetometer_data_raw[2],
                    magnetometer_yaw,
                    magnetometer_data_secondary[0],
                    magnetometer_data_secondary[1],
                    magnetometer_data_secondary[2],
                    mag2_x_offset,
                    mag2_y_offset,
                    mag2_z_offset,
                    magnetometer_data_secondary_raw[0],
                    magnetometer_data_secondary_raw[1],
                    magnetometer_data_secondary_raw[2],
                    magnetometer_yaw_secondary,
                    gps_yaw,
                    gyro_yaw,
                    imu_orientation[0],
                    imu_orientation[1],
                    average_rpm
                );
            }
        }

        // Be sure that the write still happens at least once per second
        if(skip_write) return;

        if(sd_card_async){
            if(use_simple_async){
                sd_special_write_chunk_of_string_data_no_slave_response(sd_card_get_buffer_pointer(1));
                sd_buffer_clear(1);
            }else{
                if(use_blackbox_logging){
                    logging2 = DWT->CYCCNT;
                    
                    // uint8_t * buffer_new = (uint8_t *)sd_card_get_buffer_pointer(1);
                    // printf("%d write  ", data_size);
                    // for (uint16_t i = 0; i < data_size; i++){
                    //     printf("%02X ", buffer_new[i]);
                    // }
                    // printf("\n");

                    sd_special_write_chunk_of_byte_data_async(sd_card_get_buffer_pointer(1), data_size);

                    sd_buffer_swap();
                    sd_buffer_clear_index(1); // Reset the index
                    // sd_buffer_clear(1); // Dont need to wipe all of it for now

